{
{
id: 1
Name: Academy at Tolaria West
Type: "Plane - Dominaria"
Planeshift: "At the beginning of your end step, if you have no cards in hand, draw three cards. [When Academy of Tolaria West comes into play you may draw a card and then discard a card.]"
Chaos: "Draw a card."
}
{
id: 2
Name: Akoum
Type: "Plane - Zendikar"
Planeshift: "At the beginning of your upkeep, create a 3/1 red Elemental creature token with haste."
Chaos: "Sacrifice a creature you control: Destroy target creature. You lose 3 life."
}
{
id: 3
Name: Alefis Tavern
Type: "Plane - Zaegoth"
Planeshift: "Target creature gains +2/+2 and Goad until the beginning of your next turn"
Chaos: "Choose a color. All creatures of the chosen color gain Goad until the beginning of your next turn."
}
{
id: 4
Name: Apocrypha
Type: "Plane - Oblivion"
Planeshift: "At the beginning of your post-combat Main phase, choose and exile target card from your hand. You may play that card this turn and that card costs {2} less to cast."
Chaos: "You may exile target instant or sorcery card from target player's graveyard, until end of turn you may cast that card and you may spend mana as though it were mana of any color to cast that spell."
}
{
id: 5
Name: Archmages Chambers
Type: "Plane - Zaegoth"
Planeshift: "Whenever a player casts a spell with one or more targets, each player reveals the top card of his or her library then puts that card at the bottom of their library. The player who reveals the card with the highest converted mana cost may change the target or targets. If two or more cards are tied for highest cost, the target or targets remain unchanged. [When Archmages Chambers comes into play Scry 1]."
Chaos: "Scry 3"
}
{
id: 6 
Name: Arena of Heros
Type: "Plane - Zaegoth"
Planeshift: "At the beginning of your end step you may have target creature you control deal damage equal to its power to target creature an opponent controls."
Chaos: "Choose target creature you control and target creature an opponent controls, those creatures fight."
}
{
id: 7 
Name: Gloomwood
Type: "Plane - Zaegoth"
Planeshift: "Creatures don't untap during their controller's untap step. Untapped creatures have Shroud. [When Gloomwood comes into play untap your creatures]."
Chaos: "Create a 1/1 green Insect creature token for each creature you control."
}
{
id: 8 
Name: Astral Arena
Type: "Plane - Kolbahan"
Planeshift: "No more than one creature can attack each combat. No more than one creature can block each combat."
Chaos: "Astral Arena deals 2 damage to each creature or each other player."
}
{
id: 9 
Name: Temple of Ascendance
Type: Plane: Zaegoth
Planeshift: At the beginning of your upkeep, put a divinity counter on Temple of Ascendance then gain X life where X is the number of divinity coutners on Temple of Ascendance.
Chaos: Exchange life total with target player
}
{
id: 10 
Name: Bala Thuuls Castle
Type: "Plane - Zaegoth"
Planeshift: "During your end step you may destroy a target creature, it can't be regenerated."
Chaos: "Clash with a target opponent. If you win, you may choose a creature card from that player's graveyard, and put it onto the battlefield under your control. If the target opponent wins they choose a creature card from your graveyard, and put it onto the battlefield under their control.
Replace: Yes
}
{
id: 11 
Name: Bandit Citadel
Type: "Plane - Kamigawa"
Planeshift: "Attacking creatures gain Lifelink."
Chaos: "Sacrifice a creature. You gain 6 life."
}
{
id: 12 
Name: Breathtaking Vista
Type: "Plane - Ushval"
Planeshift: "At the beginning of your upkeep, reveal the top 5 cards of your library, you may put a land card revealed this way into your hand, put the remaining cards on the bottom of your library in any order."
Chaos: "You may have target creature get +X/+X until end of turn, where X is equal to the number of lands you control."
}
{
id: 13 
Name: Windriddle Palaces
Type: Plane Belenon
Planeshift: Players play with the top card of their libraries revealed. You may cast the top card of any player's library.
Chaos: Each player puts the top card of his or her library into his or her graveyard.
}
{
id: 14 
Name: Carac Agaialor
Type: "Plane - Oblivion"
Planeshift: "Commanders are Indestructible. [When Carac Agaialor comes into play you may cast your commander without paying its mana cost]."
Chaos: "If you control your commander, your commander deals damage equal to its power to each creature."
}
{
id: 15 
Name: Valley of Idols
Type: Plane: Tarkir
Planeshift: All other players Commanders cost 1 less generic mana to cast. [When Valley of Idols comes into play you may cast your commander at no cost].
Chaos: Each player may cast their commander without paying it's mana cost. You gain 2 life for each commander cast this way.
}
{
id: 16 
Name: The Royal Treasury
Type: Plane: Zaegoth
Planeshift: At the beginning of your upkeep, put a Tithe counter on The Royal Treasury. Scry X where X is the number of tithe counters on The Royal Treasury then draw a card.
Chaos: Target player reveals the top X cards of his or her library, where X is the number of Tithe counters on The Royal Treasury. You may cast one of those revealed cards without paying its mana cost. Put the other revealed cards on the bottom of that players library.
}
{
id: 17 
Name: Cliffs of Contradiction
Type: "Plane - Inversia"
Planeshift: "At the beginning of your upkeep, manifest the top card of your library (Put it onto the battlefield face down as a 2/2 creature. Turn it face up any time for its mana cost if it's a creature card). [When Cliffs of Contradiction comes into play you may manafest a card from your hand]."
Chaos: "Turn all face down cards on the battlefield face up. Any instant or sorcery cards revealed this way are put into the graveyard with no effect."
}
{
id: 18 
Name: Court of Loarderon
Type: "Plane: Azeroth"
Planeshift: Your opponents can't cast spells or activate abilities during your turn."
Chaos: "Each opponent exiles a random card from their hand. Until the end of your turn, you may cast cards exiled this way and you may spend mana as though it were mana of any color to cast that spell."
}
{
id: 19 
Name: Dal-Shan
Type "Plane: Tarkir"
Planeshift: "All creatures lose Flying and cannot gain Flying."
Chaos: "Deal 5 damage to target creature."
}
{
id: 20 
Name: The Great Forest
Type: Plane Lorwyn
Planeshift:  Each creature assigns combat damage equal to its toughness rather than its power.
Chaos: Creatures you control get +0/+2 and gain trample until end of turn.
}
{
id: 21 
Name: Dalarbek Jungle
Type: "Plane: Zaegoth"
Planeshift: "Whenever a creature you control attacks, put a +1/+1 counter on it."
Chaos: "Creatures you control gain Trample until end of turn."
}
{
id: 22 
Name: Doomraider Encampment
Type: "Plane: Ushval"
Planeshift: "Whenever a creature enters the battlefield, it gains Haste and Trample until end of turn."
Chaos: "Until end of turn you gain whenever you cast a creature spell create a 3/1 red Goblin Warrior creature token."
}
{
id: 23 
Name: Edge of Malacol
Type: "Plane - Belenon"
Planeshift: "At the beginning of your upkeep, if you control seven or more basic lands you may return target creature from your graveyard to the battlefield."
Chaos: "You may return target permanent card from your graveyard to your hand." 
Replace: Yes
}
{
id: 24 
Name: Eloren Wilds
Type: "Plane: Shandalar"
Planeshift: "Whenever a player taps a land for mana, that player adds one mana of any type that land produced."
Chaos: "{X}: Gain X life."
}
{
id: 25 
Name: Emeria
Type: "Plane: Zendikar"
Planeshift: "At the beginning of your upkeep, if you control seven or more basic lands you may return target creature from your graveyard to the battlefield."
Chaos: "You may return target permanent card from your graveyard to your hand." 
}
{
id: 26 
Name: Fangorn Keep
Type: "Plane: Nozgorod"
Planeshift: "At the beginning of your upkeep, put a Rumble counter on this Planechase card, and create X colorless 1/1 worker artifact creature tokens, where X is equal to the number of Rumble counters on this Planechase card."
Chaos: "Destroy all nonland permanents with converted mana cost less then the number of Rumble counters on this planechase card. Then remove this Planechase card from the game."
Replace: Yes
}
{
id: 27 
Name: Etiri's Factory
Type: "Plane: Zaegoth"
Planeshift: "Creatures you control have Vigilance."
Chaos: "Until end of turn, creatures you control gain indestructible."
}
{
id: 28 
Name: Fortress of Jin-Gitaxius
Type: "Plane: New Phyrexia"
Planeshift: "Whenever a player discards a card, each player draws a card."
Chaos: "Target player discards two cards."
}
{
id: 29 
Name: Furnace Layer
Type: "Plane: New Phyrexia"
Planeshift: "At the beginning of your upkeep, select target player. That player discards a card. If that player discards a land card this way, he or she loses 4 life."
Chaos: "Sacrifice a land: Exile target nonland permanent."
}
{
id: 30 
Name: Gaeas Sanctuary
Type: "Plane: Dominaria"
Planeshift: "Creature spells can't be countered. Players can't draw more then one card each turn."
Chaos: "Look at the top 5 cards of your library, you may reveal a creature card, if you do put that card into your hand. Put the remaining cards at the bottom of your library in any order."
}
}
